<a href="https://colab.research.google.com/github/BundeAmos/Time_Series/blob/main/Forecasting_Energy_Demand.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>












Markdown

Python 3
Forecasting Energy Demand
#  Forecasting Energy Demand
Importing Necessary Libraries and Functions
The first thing we need to do is import the necessary functions and libraries that we will be working with throughout the topic. We should also go ahead and upload all the of the necessary data sets here instead of loading them as we go. We will be using energy production data from PJM Interconnection. They are a regional transmission organization that coordinates the movement of wholesale electricity in parts of the United States. Specifically, we will be focused on a region of Pennsylvania. We will also be using temperature data collected from the National Oceanic and Atmospheric Assocation (NOAA).

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Preparing the Energy and Temperature Data

In [3]:
# Loading the Needed Data Sets 
weather = pd.read_csv('/content/My_Sample_data/hr_temp_1_subset.csv')
energy = pd.read_csv('/content/My_Sample_data/hrl_load_metered.csv')

In [4]:
weather.head()

       STATION                 DATE  ... SOURCE  HourlyDryBulbTemperature
0  72520514762  2017-02-01T00:53:00  ...      7                      37.0
1  72520514762  2017-02-01T01:53:00  ...      7                      37.0
2  72520514762  2017-02-01T02:53:00  ...      7                      36.0
3  72520514762  2017-02-01T03:53:00  ...      7                      36.0
4  72520514762  2017-02-01T04:53:00  ...      7                      36.0

[5 rows x 5 columns]

In [5]:
energy.head()

  datetime_beginning_utc datetime_beginning_ept  ...        mw is_verified
0          2/1/2017 5:00          2/1/2017 0:00  ...  1419.881        True
1          2/1/2017 6:00          2/1/2017 1:00  ...  1379.505        True
2          2/1/2017 7:00          2/1/2017 2:00  ...  1366.106        True
3          2/1/2017 8:00          2/1/2017 3:00  ...  1364.453        True
4          2/1/2017 9:00          2/1/2017 4:00  ...  1391.265        True

[5 rows x 8 columns]

In [6]:
data = {'MW': energy['mw'], 'Temp': weather['HourlyDryBulbTemperature'], 'Date': weather['DATE']}

In [7]:
df = pd.DataFrame(data)

In [8]:
print(df.dtypes)

MW      float64
Temp    float64
Date     object
dtype: object

In [9]:
df['Date'] = pd.to_datetime(df['Date'])
print(df.dtypes)

MW             float64
Temp           float64
Date    datetime64[ns]
dtype: object

In [10]:
df['hour'] = pd.DatetimeIndex(pd.to_datetime(df['Date'])).hour
df['day'] = pd.DatetimeIndex(pd.to_datetime(df['Date'])).day
df['weekday'] = df['Date'].dt.dayofweek
df['month'] = pd.DatetimeIndex(pd.to_datetime(df['Date'])).month
df['year'] = pd.DatetimeIndex(pd.to_datetime(df['Date'])).year

df.head()

         MW  Temp                Date  hour  day  weekday  month  year
0  1419.881  37.0 2017-02-01 00:53:00     0    1        2      2  2017
1  1379.505  37.0 2017-02-01 01:53:00     1    1        2      2  2017
2  1366.106  36.0 2017-02-01 02:53:00     2    1        2      2  2017
3  1364.453  36.0 2017-02-01 03:53:00     3    1        2      2  2017
4  1391.265  36.0 2017-02-01 04:53:00     4    1        2      2  2017

In [11]:
df =df.set_index('Date')

In [12]:
sum(df['Temp'].isnull())

37

In [13]:
df['Temp'] = df['Temp'].interpolate(method='linear')

In [14]:
sum(df['Temp'].isnull())

0

In [17]:
sum(df['MW'].isnull())

0

In [15]:
#Training and Validation Split #
train = pd.DataFrame(df['2017-01-01':'2019-12-31'])
test = pd.DataFrame(df['2020-01-01':'2020-01-31'])

In [16]:
train.head()

                           MW  Temp  hour  day  weekday  month  year
Date
2017-02-01 00:53:00  1419.881  37.0     0    1        2      2  2017
2017-02-01 01:53:00  1379.505  37.0     1    1        2      2  2017
2017-02-01 02:53:00  1366.106  36.0     2    1        2      2  2017
2017-02-01 03:53:00  1364.453  36.0     3    1        2      2  2017
2017-02-01 04:53:00  1391.265  36.0     4    1        2      2  2017

In [18]:
test.head()

                           MW  Temp  hour  day  weekday  month  year
Date
2020-01-01 00:53:00  1363.428  31.0     0    1        2      1  2020
2020-01-01 01:53:00  1335.975  29.0     1    1        2      1  2020
2020-01-01 02:53:00  1296.817  30.0     2    1        2      1  2020
2020-01-01 03:53:00  1288.403  30.0     3    1        2      1  2020
2020-01-01 04:53:00  1292.263  31.0     4    1        2      1  2020